ArtShare/app/controllers/users_controller.rb

    def destroy
        user = User.find_by(id: params[:id])
        if user
            user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]