RedditClone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "this is my first edited sub"], ["updated_at", "2019-12-02 18:03:11.651271"], ["id", 1]]
---
    def update
        @sub = Sub.find(params[:id])
        if @sub.moderator_id == current_user.id
            if @sub.update(sub_params)

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "subs" WHERE "subs"."id" = $1  [["id", 7]]
---
    def destroy
        @sub = Sub.find(params[:id])
        @sub.destroy